[Rainmeter]
Update=-1
OnRefreshAction=[!Draggable 0][!ClickThrough 0][!ZPos 1];[!WriteKeyValue Variables ShowDock 1]
RightMouseUpAction=!Manage Skins "suit\图标\dock" "dock2.ini"
OnUnfocusAction=[!Show "suit\图标"][!Refresh]

[Metadata]
Author=天下一番
Version=1.0
License=Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International
Information=有入场动画的的应用快捷方式。|载入方式为从右往左依次进入，|非线性动画，先快后慢。

[Variables]
;ShowDock=1
btw=162
;按钮宽度，即按钮图片宽度的1/3。
bth=89
;按钮高度，即按钮图片的高度。
bty=0
;按钮之间的间隔
x=0
;整体向右偏移量
y=0
;整体向下偏移量
strDown=-16
;文本向下偏移量。
strRight=14
;文本向右偏移量
strSize=13
;字体大小
strColor=240,12,235
;字体颜色，不写透明度，且为十进制。
show=[!Show "suit\图标"][!Refresh]
String1=百度一下
Path1="www.baidu.com"
String2=雨滴论坛
Path2="https://bbs.rainmeter.cn/"
String3=雨滴官网
Path3="www.rainmeter.net"
String4=微信文件
Path4=""C:\Users\kangjun\Documents\WeChat Files\Recardo_M_Lu\FileStorage\File\2019-10\""
String5=文件校验
Path5=!ToggleConfig "suit\工具\校验" "hash.ini"
String6=多彩频谱
Path6=!ToggleConfig "suit\频谱" "条形.ini"
String7=桌面时钟
Path7=!ToggleConfig "suit\时钟" "数码.ini"
String8=天气
Path8=!ToggleConfig "suit\天气" "weather.ini"
String9=锁屏
Path9="!ActivateConfig suit\屏保 模糊.ini"
String10=关机
Path10="!ActivateConfig suit\桌面 桌面.ini"
ShowDock=1

[pd]
Measure=Calc
Formula=#ShowDock#
IfEqualValue=0
IfEqualAction=[!CommandMeasure repeat "execute 1"]

[background]
Meter=Image
SolidColor=0,0,0,1
X=#x#
Y=#y#
W=#btw#
H=((#bth#+#bty#)*10)
MouseLeaveAction=[!Show "suit\图标"][!Refresh]
Hidden=#ShowDock#
[bg]
Meter=Image
SolidColor=0,0,0,255
W=#btw#
H=((#bth#+#bty#)*10)
Y=#y#
X=#x#
Hidden=#ShowDock#

[getin]
Measure=Script
ScriptFile=#@#Script\slidein.lua
[repeat]
Measure=Plugin
Plugin=ActionTimer
ActionList1=Repeat firstaction,16,30
firstaction=[!UpdateMeasure getin]

[dockstyle]
ButtonImage=#@#Image\button\button1
DynamicVariables=1
ImageTint=255,255,255,0
Y=(#bth#+#bty#)r
Container =bg
Hidden=#ShowDock#
[StringStyle]
FontSize=#strSize#
FontColor=#strColor#
AntiAlias=1
X=(#btw#/2+#strRight#+#x#)
W=#btw#
H=#bth#
StringAlign=CenterCenter
Container =bg
Hidden=#ShowDock#

[dock1]
Meter=Button
MeterStyle=dockstyle
Y=#y#
LeftMouseDownAction=#show#[#Path1#]
Container =bg
[dock2]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path2#]
[dock3]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path3#]
[dock4]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path4#]
[dock5]
Meter=Button
MeterStyle=dockstyle
LeftMouseUpAction=#show#[#Path5#]
[dock6]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path6#]
[dock7]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path7#]
[dock8]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=[#Path8#]
[dock9]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path9#]
[dock10]
Meter=Button
MeterStyle=dockstyle
LeftMouseDownAction=#show#[#Path10#]

[string1]
Meter=String
Text=#String1#
MeterStyle=StringStyle
[string2]
Meter=String
Text=#String2#
MeterStyle=StringStyle
[string3]
Meter=String
Text=#String3#
MeterStyle=StringStyle
[string4]
Meter=String
Text=#String4#
MeterStyle=StringStyle
[string5]
Meter=String
Text=#String5#
MeterStyle=StringStyle
[string6]
Meter=String
Text=#String6#
MeterStyle=StringStyle
[string7]
Meter=String
Text=#String7#
MeterStyle=StringStyle
[string8]
Meter=String
Text=#String8#
MeterStyle=StringStyle
[string9]
Meter=String
Text=#String9#
MeterStyle=StringStyle
[string10]
Meter=String
Text=#String10#
MeterStyle=StringStyle
